app/Models/ModelUser.php

    public function LoginUser($EMAIL, $PASSWORD)
    {
        // 2. Sesuaikan nama tabel di baris pencarian login
        return $this->db->table('tbl_user')
            ->where([
                'email'    => $EMAIL,
                'password' => $PASSWORD,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'lanjaradi09@gmail.com'
AND `password` = '7a695ed3f2c0b20f67f4067c3606b287a4a5a36e'

    public function GetAllData()
    {
        // 3. Sesuaikan nama tabel di baris ambil semua data
        return $this->db->table('tbl_user')->get()->getResultArray();
---
SELECT *
FROM `tbl_user`