app/Models/ModelSetting.php

SELECT *
FROM `tbl_setting`
WHERE `id` = 1
---
    public function DataWeb()
    {
        return $this->db->table('tbl_setting')
            ->where('id', 1)
            ->get()->getRowArray();