app/Models/ModelMinimarket.php

    public function AllData()
    {
        return $this->db->table('tbl_minimarket')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_minimarket`